#### Terragrunt Plan 📖 (infra/dev/path1) `success`

<details><summary>Show Plan</summary>

```
04:48:14.888 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
04:48:14.888 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
04:48:14.888 STDOUT tofu:   + create
04:48:14.888 STDOUT tofu: OpenTofu will perform the following actions:
04:48:14.888 STDOUT tofu:   # google_storage_bucket.auto-expire will be created
04:48:14.888 STDOUT tofu:   + resource "google_storage_bucket" "auto-expire" {
04:48:14.888 STDOUT tofu:       + effective_labels            = {
04:48:14.888 STDOUT tofu:           + "goog-terraform-provisioned" = "true"
04:48:14.888 STDOUT tofu:         }
04:48:14.888 STDOUT tofu:       + force_destroy               = true
04:48:14.888 STDOUT tofu:       + id                          = (known after apply)
04:48:14.888 STDOUT tofu:       + location                    = "US"
04:48:14.888 STDOUT tofu:       + name                        = "sfno-murali-acfcgess-dbucket"
04:48:14.888 STDOUT tofu:       + project                     = "murali-test-project"
04:48:14.889 STDOUT tofu:       + project_number              = (known after apply)
04:48:14.889 STDOUT tofu:       + public_access_prevention    = "enforced"
04:48:14.889 STDOUT tofu:       + rpo                         = (known after apply)
04:48:14.889 STDOUT tofu:       + self_link                   = (known after apply)
04:48:14.889 STDOUT tofu:       + storage_class               = "STANDARD"
04:48:14.889 STDOUT tofu:       + terraform_labels            = {
04:48:14.889 STDOUT tofu:           + "goog-terraform-provisioned" = "true"
04:48:14.889 STDOUT tofu:         }
04:48:14.889 STDOUT tofu:       + time_created                = (known after apply)
04:48:14.889 STDOUT tofu:       + uniform_bucket_level_access = (known after apply)
04:48:14.889 STDOUT tofu:       + updated                     = (known after apply)
04:48:14.889 STDOUT tofu:       + url                         = (known after apply)
04:48:14.889 STDOUT tofu:       + soft_delete_policy (known after apply)
04:48:14.889 STDOUT tofu:       + versioning (known after apply)
04:48:14.889 STDOUT tofu:       + website (known after apply)
04:48:14.889 STDOUT tofu:     }
04:48:14.889 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
04:48:14.889 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
04:48:14.889 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
04:48:14.889 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

*Pusher: @muralisathenapally, Directory: `infra/dev/path1`*